; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-70)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity v6 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l10)
    (at p2 l13)
    (at p3 l3)
    (at p4 l11)
    (at p5 l4)
    (at p6 l12)
    (at p7 l7)
    (at p8 l9)
    (at p9 l4)
    (at p10 l3)
    (at p11 l11)
    (at p12 l8)
    (at v1 l7)
    (at v2 l7)
    (at v3 l12)
    (at v4 l5)
    (at v5 l7)
    (at v6 l4)
    (road l4 l9)
    (road l12 l13)
    (road l5 l7)
    (road l9 l11)
    (road l1 l6)
    (road l7 l1)
    (road l12 l3)
    (road l3 l9)
    (road l4 l8)
    (road l5 l3)
    (road l3 l12)
    (road l9 l4)
    (road l6 l1)
    (road l3 l2)
    (road l3 l5)
    (road l4 l10)
    (road l8 l4)
    (road l9 l3)
    (road l10 l4)
    (road l11 l9)
    (road l2 l3)
    (road l1 l7)
    (road l13 l12)
    (road l7 l5)
    (road l2 l6)
    (road l6 l2)
    (road l2 l9)
    (road l9 l2)
    )
 (:goal (and 
(at p1 l5)
(at p2 l5)
(at p3 l2)
(at p4 l7)
))
)

; plan
1. (drive v3 l12 l13)
   deleted: (at v3 l12)
   added: (at v3 l13)
   goals met: 0 of 4
2. (pick-up v3 l13 p2 c1 c2)
   deleted: (at p2 l13) (capacity v3 c2)
   added: (in p2 v3) (capacity v3 c1)
   goals met: 0 of 4
3. (drive v3 l13 l12)
   deleted: (at v3 l13)
   added: (at v3 l12)
   goals met: 0 of 4
4. (drive v6 l4 l10)
   deleted: (at v6 l4)
   added: (at v6 l10)
   goals met: 0 of 4
5. (pick-up v6 l10 p1 c1 c2)
   deleted: (at p1 l10) (capacity v6 c2)
   added: (in p1 v6) (capacity v6 c1)
   goals met: 0 of 4
6. (drive v6 l10 l4)
   deleted: (at v6 l10)
   added: (at v6 l4)
   goals met: 0 of 4
7. (drive v6 l4 l9)
   deleted: (at v6 l4)
   added: (at v6 l9)
   goals met: 0 of 4
8. (drive v6 l9 l11)
   deleted: (at v6 l9)
   added: (at v6 l11)
   goals met: 0 of 4
9. (pick-up v6 l11 p4 c0 c1)
   deleted: (at p4 l11) (capacity v6 c1)
   added: (in p4 v6) (capacity v6 c0)
   goals met: 0 of 4
10. (drive v6 l11 l9)
   deleted: (at v6 l11)
   added: (at v6 l9)
   goals met: 0 of 4
11. (drive v6 l9 l3)
   deleted: (at v6 l9)
   added: (at v6 l3)
   goals met: 0 of 4
12. (drive v6 l3 l5)
   deleted: (at v6 l3)
   added: (at v6 l5)
   goals met: 0 of 4
13. (drop v6 l5 p1 c0 c1)
   deleted: (in p1 v6) (capacity v6 c0)
   added: (at p1 l5) (capacity v6 c1)
   goals met: 1 of 4
14. (drive v6 l5 l7)
   deleted: (at v6 l5)
   added: (at v6 l7)
   goals met: 1 of 4
15. (drop v6 l7 p4 c1 c2)
   deleted: (in p4 v6) (capacity v6 c1)
   added: (at p4 l7) (capacity v6 c2)
   goals met: 2 of 4
16. (drive v4 l5 l3)
   deleted: (at v4 l5)
   added: (at v4 l3)
   goals met: 2 of 4
17. (pick-up v4 l3 p3 c0 c1)
   deleted: (at p3 l3) (capacity v4 c1)
   added: (in p3 v4) (capacity v4 c0)
   goals met: 2 of 4
18. (drive v4 l3 l2)
   deleted: (at v4 l3)
   added: (at v4 l2)
   goals met: 2 of 4
19. (drop v4 l2 p3 c0 c1)
   deleted: (in p3 v4) (capacity v4 c0)
   added: (at p3 l2) (capacity v4 c1)
   goals met: 3 of 4
20. (drive v3 l12 l3)
   deleted: (at v3 l12)
   added: (at v3 l3)
   goals met: 3 of 4
21. (drive v3 l3 l5)
   deleted: (at v3 l3)
   added: (at v3 l5)
   goals met: 3 of 4
22. (drop v3 l5 p2 c1 c2)
   deleted: (in p2 v3) (capacity v3 c1)
   added: (at p2 l5) (capacity v3 c2)
   goals met: 4 of 4
